#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>

int main()
{
	system("chcp 1251");
	system("cls");
	char type1[9], type2[9], type3[9];
	char num3[9];
	int num1, num2;
	float km1, km2, km3;
	double min1, min2, min3;
	printf("1) Введите вид транспорта, номер маршрута, протяженность маршрута, время в дороге:");
	scanf("%s %d %f %d", type1, &num1, &km1, &min1);

	printf("2) Введите вид транспорта, номер маршрута, протяженность маршрута, время в дороге:");
	scanf("%s %d %f %d", type2, &num2, &km2, &min2);

	printf("3) Введите вид транспорта, номер маршрута, протяженность маршрута, время в дороге:");
	scanf("%s %s %f %d", type3, num3, &km3, &min3);


	printf("---------------------------------------------------------------------------------------------------\n");
	printf("|Ведомость общественного транспорта\t\t\t\t\t\t\t\t  |\n");
	printf("|-------------------------------------------------------------------------------------------------|\n");
	printf("|Вид транспорта    |№ маршрута              |Протяженность маршрута (км)   |Время в дороге (мин)  |\n");
	printf("|------------------|------------------------|------------------------------|----------------------|\n");
	printf("| %-16s | %-22d | %-28.2f | %-20d |\n", type1, num1, km1, min1);
	printf("|------------------|------------------------|------------------------------|----------------------|\n");
	printf("| %-16s | %-22d | %-28.1f | %-20d |\n", type2, num2, km2, min2);
	printf("|------------------|------------------------|------------------------------|----------------------|\n");
	printf("| %-16s | %-22s | %-28.1f | %-20d |\n", type3, num3, km3, min3);
	printf("|-------------------------------------------------------------------------------------------------|\n");
	printf("|Примечание: Тр-трамвай, Тс-тролейбус, А-автобус\t\t\t\t\t\t  |\n");
	printf("---------------------------------------------------------------------------------------------------\n");


}